ancher-bohdan/stm32_usb_interface/USB/STM32_USB_Device_Library/Class/audio/src/usbd_audio_core.c
/* USB AUDIO device Configuration Descriptor */
static uint8_t usbd_audio_CfgDesc[AUDIO_CONFIG_DESC_SIZE] =
{
  /* Configuration 1 */
  0x09,                                 /* bLength */
  USB_CONFIGURATION_DESCRIPTOR_TYPE,    /* bDescriptorType */
  LOBYTE(AUDIO_CONFIG_DESC_SIZE),       /* wTotalLength  183 bytes*/
  HIBYTE(AUDIO_CONFIG_DESC_SIZE),      
  0x03,                                 /* bNumInterfaces */
  0x01,                                 /* bConfigurationValue */
  0x00,                                 /* iConfiguration */
  0x80,                                 /* bmAttributes  BUS Powred*/
  0x32,                                 /* bMaxPower = 100 mA*/
  /* 09 byte*/

  /* Interface Association descriptor  */
  0x08,                                 /* bLength */
  0x0B,                                 /* bDescriptorType */
  0x00,                                 /* bFirstInterface */
  0x03,                                 /* bInterfaceCount */
  USB_DEVICE_CLASS_AUDIO,               /* bFunctionClass */
  0x00,                                 /* bFunctionSubclass */
  0x20,                                 /* bFunctionProtocol */
  0x00,                                 /* iFunction */
  /* 08 byte */

  /* USB Headset Standard interface descriptor */
  AUDIO_INTERFACE_DESC_SIZE,            /* bLength */
  USB_INTERFACE_DESCRIPTOR_TYPE,        /* bDescriptorType */
  0x00,                                 /* bInterfaceNumber */
  0x00,                                 /* bAlternateSetting */
  0x00,                                 /* bNumEndpoints */
  USB_DEVICE_CLASS_AUDIO,               /* bInterfaceClass */
  AUDIO_SUBCLASS_AUDIOCONTROL,          /* bInterfaceSubClass */
  0x20,                                 /* bInterfaceProtocol */
  0x00,                                 /* iInterface */
  /* 09 byte*/
  
  /* USB Headset Class-specific AC Interface Descriptor */
  0x09,                                 /* bLength */
  AUDIO_INTERFACE_DESCRIPTOR_TYPE,      /* bDescriptorType */
  AUDIO_CONTROL_HEADER,                 /* bDescriptorSubtype */
  0x00,          /* 2.00 */             /* bcdADC */
  0x02,
  0x04,                                 /* Category - Headset*/
  0x5D,                                 /* wTotalLength */
  0x00,
  0x00,                                 /* bmControls */
  /* 9 byte*/

  /* USB Headset Clock Source Descriptor */
  0x08,                                 /* bLength */
  AUDIO_INTERFACE_DESCRIPTOR_TYPE,      /* bDescriptorType */
  0x0A,                                 /* bDescriptorSubtype */
  0x04,                                 /* Clock source entity ID */
  0x03,                                 /* bmAttributes */
  0x07,                                 /* bmControls */
  0x00,                                 /* bReferenceTerminal */
  0x00,                                 /* wClockSourceStr */
  /* 8 byte */
  
  /* USB Microphone Input Terminal Descriptor */
  0x11,                                 /* bLength */
  AUDIO_INTERFACE_DESCRIPTOR_TYPE,      /* bDescriptorType */
  AUDIO_CONTROL_INPUT_TERMINAL,         /* bDescriptorSubtype */
  0x01,                                 /* bTerminalID */
  0x01,                                 /* wTerminalType MICROPHONE   0x0201 */
  0x02,
  0x00,                                 /* bAssocTerminal */
  0x04,                                 /* Connected Clock entity */
  0x01,                                 /* bNrChannels */
  0x00,                                 /* wChannelConfig 0x0000  Mono */
  0x00,
  0x00,
  0x00,
  0x00,                                 /* iChannelNames */
  0x00,                                 /* Controls */
  0x00,
  0x00,                                 /* String description */
  /* 17 byte*/
  
  /*USB Microphone Output Terminal Descriptor */
  0x0C,                                 /* bLength */
  AUDIO_INTERFACE_DESCRIPTOR_TYPE,      /* bDescriptorType */
  AUDIO_CONTROL_OUTPUT_TERMINAL,        /* bDescriptorSubtype */
  0x02,                                 /* bTerminalID */
  0x01,                                 /* wTerminalType  USB_STREAMING 0x0101*/
  0x01,
  0x00,                                 /* bAssocTerminal */
  0x01,                                 /* bSourceID */
  0x04,                                 /* Connected clock entity ID */
  0x00,                                 /* Controls */
  0x00,
  0x00,                                 /* String description */
  /* 12 byte*/

  /* USB Speaker Input Terminal Descriptor */
  0x11,                                 /* bLength */
  AUDIO_INTERFACE_DESCRIPTOR_TYPE,      /* bDescriptorType */
  AUDIO_CONTROL_INPUT_TERMINAL,         /* bDescriptorSubtype */
  0x05,                                 /* bTerminalID */
  0x01,                                 /* wTerminalType AUDIO_TERMINAL_USB_STREAMING   0x0101 */
  0x01,
  0x00,                                 /* bAssocTerminal */
  0x04,                                 /* connected clock entity id */
  0x02,                                 /* bNrChannels */
  0x00,                                 /* wChannelConfig 0x0000  Mono */
  0x00,
  0x00,
  0x00,
  0x00,                                 /* iChannelNames */
  0x00,                                 /* Controls */
  0x00,
  0x00,                                 /* String description */
  /* 17 byte*/

  /* USB Speaker Audio Feature Unit Descriptor */
  0x12,                                 /* bLength */
  AUDIO_INTERFACE_DESCRIPTOR_TYPE,      /* bDescriptorType */
  AUDIO_CONTROL_FEATURE_UNIT,           /* bDescriptorSubtype */
  AUDIO_OUT_FEATURE_UNIT_ID,            /* bUnitID */
  0x05,                                 /* bSourceID */
  0x03,                                 /* bmaControls (MUTE) */
  0x00,                                 
  0x00,
  0x00,
  0x03,                                 /* bmaControls(1) (MUTE) */
  0x00,                                 
  0x00,
  0x00,
  0x03,                                 /* bmaControls(2) (MUTE) */
  0x00,                                 
  0x00,
  0x00,
  0x00,                                 /* Feature */
  /* 18 byte*/

  /* USB Speaker Output Terminal Descriptor */
  0x0C,                                 /* bLength */
  AUDIO_INTERFACE_DESCRIPTOR_TYPE,      /* bDescriptorType */
  AUDIO_CONTROL_OUTPUT_TERMINAL,        /* bDescriptorSubtype */
  0x03,                                 /* bTerminalID */
  0x01,                                 /* wTerminalType  0x0301*/
  0x03,
  0x00,                                 /* bAssocTerminal */
  AUDIO_OUT_FEATURE_UNIT_ID,            /* bSourceID */
  0x04,                                 /* Connected clock entity ID */
  0x00,                                 /* Controls */
  0x00,
  0x00,                                 /* String description */
  /* 12 byte*/

  /* USB Speaker Standard AS Interface Descriptor - Audio Streaming Zero Bandwith */
  /* Interface 1, Alternate Setting 0                                             */
  AUDIO_INTERFACE_DESC_SIZE,            /* bLength */
  USB_INTERFACE_DESCRIPTOR_TYPE,        /* bDescriptorType */
  0x01,                                 /* bInterfaceNumber */
  0x00,                                 /* bAlternateSetting */
  0x00,                                 /* bNumEndpoints */
  USB_DEVICE_CLASS_AUDIO,               /* bInterfaceClass */
  AUDIO_SUBCLASS_AUDIOSTREAMING,        /* bInterfaceSubClass */
  0x20,//AUDIO_PROTOCOL_UNDEFINED,             /* bInterfaceProtocol */
  0x00,                                 /* iInterface */
  /* 09 byte*/
  
  /* USB Speaker Standard AS Interface Descriptor - Audio Streaming Operational */
  /* Interface 1, Alternate Setting 1                                           */
  AUDIO_INTERFACE_DESC_SIZE,            /* bLength */
  USB_INTERFACE_DESCRIPTOR_TYPE,        /* bDescriptorType */
  0x01,                                 /* bInterfaceNumber */
  0x01,                                 /* bAlternateSetting */
  0x01,                                 /* bNumEndpoints */
  USB_DEVICE_CLASS_AUDIO,               /* bInterfaceClass */
  AUDIO_SUBCLASS_AUDIOSTREAMING,        /* bInterfaceSubClass */
  0x20,//AUDIO_PROTOCOL_UNDEFINED,             /* bInterfaceProtocol */
  0x00,                                 /* iInterface */
  /* 09 byte*/
  
  /* USB Speaker Audio Streaming Interface Descriptor */
  0x10,                                 /* bLength */
  AUDIO_INTERFACE_DESCRIPTOR_TYPE,      /* bDescriptorType */
  AUDIO_STREAMING_GENERAL,              /* bDescriptorSubtype */
  0x05,                                 /* bTerminalLink */
  0x00,                                 /* controls */
  0x01,                                 /* Format type */
  0x01,                                 /* Formats : PCM */
  0x00,
  0x00,
  0x00,
  0x02,                                 /* bNrChannels */
  0x00,                                 /* Channels Config */
  0x00,
  0x00,
  0x00,
  0x00,                                 /* String descriptor index */
  /* 16 byte */
  
  /* USB Speaker Audio Type I Format Interface Descriptor */
  0x06,                                 /* bLength */
  AUDIO_INTERFACE_DESCRIPTOR_TYPE,      /* bDescriptorType */
  AUDIO_STREAMING_FORMAT_TYPE,          /* bDescriptorSubtype */
  AUDIO_FORMAT_TYPE_I,                  /* bFormatType */ 
  0x02,                                 /* bSubFrameSize :  2 Bytes per frame (16bits) */
  16,                                   /* bBitResolution (16-bits per sample) */ 
  /* 6 byte*/
  
  /* Endpoint 1 - Standard Descriptor */
  0x07,                                 /* bLength */
  USB_ENDPOINT_DESCRIPTOR_TYPE,         /* bDescriptorType */
  AUDIO_OUT_EP,                         /* bEndpointAddress 1 out endpoint*/
  0x09,                                 /* bmAttributes */
  AUDIO_PACKET_SZE(USBD_AUDIO_FREQ, 2), /* wMaxPacketSize in Bytes (Freq(Samples)*2(Stereo)*2(HalfWord)) */
  0x01,                                 /* bInterval */
  /* 07 byte*/
  
  /* Endpoint - Audio Streaming Descriptor*/
  0x08,                                 /* bLength */
  AUDIO_ENDPOINT_DESCRIPTOR_TYPE,       /* bDescriptorType */
  AUDIO_ENDPOINT_GENERAL,               /* bDescriptor */
  0x00,                                 /* bmAttributes */
  0x00,                                 /* bmControls */
  0x01,                                 /* bLockDelayUnits */
  0x01,                                 /* wLockDelay */
  0x00,
  /* 08 byte*/
  
