ancher-bohdan/stm32_usb_interface/USB/STM32_USB_Device_Library/Class/audio/src/usbd_audio_core.c
  /* USB Microphone Standard AS Interface Descriptor - Audio Streaming Zero Bandwith */
  /* Interface 2, Alternate Setting 0                                             */
  AUDIO_INTERFACE_DESC_SIZE,            /* bLength */
  USB_INTERFACE_DESCRIPTOR_TYPE,        /* bDescriptorType */
  0x02,                                 /* bInterfaceNumber */
  0x00,                                 /* bAlternateSetting */
  0x00,                                 /* bNumEndpoints */
  USB_DEVICE_CLASS_AUDIO,               /* bInterfaceClass */
  AUDIO_SUBCLASS_AUDIOSTREAMING,        /* bInterfaceSubClass */
  0x20,//AUDIO_PROTOCOL_UNDEFINED,             /* bInterfaceProtocol */
  0x00,                                 /* iInterface */
  /* 09 byte*/
  
  /* USB Microphone Standard AS Interface Descriptor - Audio Streaming Operational */
  /* Interface 2, Alternate Setting 1                                           */
  AUDIO_INTERFACE_DESC_SIZE,            /* bLength */
  USB_INTERFACE_DESCRIPTOR_TYPE,        /* bDescriptorType */
  0x02,                                 /* bInterfaceNumber */
  0x01,                                 /* bAlternateSetting */
  0x01,                                 /* bNumEndpoints */
  USB_DEVICE_CLASS_AUDIO,               /* bInterfaceClass */
  AUDIO_SUBCLASS_AUDIOSTREAMING,        /* bInterfaceSubClass */
  0x20,//AUDIO_PROTOCOL_UNDEFINED,             /* bInterfaceProtocol */
  0x00,                                 /* iInterface */
  /* 09 byte*/
  
  /* USB Microphone Audio Streaming Interface Descriptor */
  0x10,                                 /* bLength */
  AUDIO_INTERFACE_DESCRIPTOR_TYPE,      /* bDescriptorType */
  AUDIO_STREAMING_GENERAL,              /* bDescriptorSubtype */
  0x02,                                 /* bTerminalLink */
  0x00,                                 /* Contorls */
  0x01,                                 /* Format type */
  0x01,                                 /* Format - PCM */
  0x00,
  0x00,
  0x00,
  0x01,                                 /* bNrChannels */
  0x00,                                 /* Channel config */
  0x00,
  0x00,
  0x00,
  0x00,                                 /* String descriptor index */
  /* 16 byte*/
  
  /* USB Microphone Type I Format Interface Descriptor */
  0x06,                                 /* bLength */
  AUDIO_INTERFACE_DESCRIPTOR_TYPE,      /* bDescriptorType */
  AUDIO_STREAMING_FORMAT_TYPE,          /* bDescriptorSubtype */
  AUDIO_FORMAT_TYPE_I,                /* bFormatType */ 
  0x02,                                 /* bSubFrameSize :  2 Bytes per frame (16bits) */
  16,                                   /* bBitResolution (16-bits per sample) */ 
  /* 6 byte*/
  
  /* Endpoint 1 - Standard Descriptor */
  0x07,                                 /* bLength */
  USB_ENDPOINT_DESCRIPTOR_TYPE,         /* bDescriptorType */
  AUDIO_IN_EP,                         /* bEndpointAddress 1 out endpoint*/
  0x05,                                 /* bmAttributes */
  AUDIO_PACKET_SZE(USBD_IN_FREQ, 1),    /* wMaxPacketSize in Bytes (Freq(Samples)*2(Stereo)*2(HalfWord)) */
  0x01,                                 /* bInterval */
  /* 07 byte */
  
  /* Endpoint - Audio Microphone Descriptor*/
  0x08,                                 /* bLength */
  AUDIO_ENDPOINT_DESCRIPTOR_TYPE,       /* bDescriptorType */
  AUDIO_ENDPOINT_GENERAL,               /* bDescriptor */
  0x00,                                 /* bmAttributes */
  0x00,                                 /* Controls */
  0x00,                                 /* bLockDelayUnits */
  0x00,                                 /* wLockDelay */
  0x00,
  /* 08 byte*/
} ;

/**
  * @}
  */ 

static struct um_buffer_handle *in_handle = NULL;
static struct um_buffer_handle *audio_handle = NULL;
static uint8_t null_data[AUDIO_IN_PACKET] = { 0 };

/** @defgroup usbd_audio_Private_Functions
  * @{
  */

/**
  * @brief  Init
  *         Initialize and configures all required resources for audio play function.
  * @param  AudioFreq: Startup audio frequency. 
  * @param  Volume: Startup volume to be set.
  * @param  options: specific options passed to low layer function.
  * @retval AUDIO_OK if all operations succeed, AUDIO_FAIL else.
  */
static uint8_t  Init         (uint32_t AudioFreq, 
                              uint32_t Volume, 
                              uint32_t options)
{
  static uint32_t Initialized = 0;
  int res = 0;
  
  /* Check if the low layer has already been initialized */
  if (Initialized == 0)
  {
    if (EVAL_AUDIO_Init(OUTPUT_DEVICE_AUTO, Volume, AudioFreq) != 0)
    {
      return USBD_FAIL;
    }

    /* Set the Initialization flag to prevent reinitializing the interface again */
    Initialized = 1;
  }

  audio_handle = (struct um_buffer_handle *)malloc(sizeof(struct um_buffer_handle));
  in_handle = (struct um_buffer_handle *)malloc(sizeof(struct um_buffer_handle));
  
  res += um_handle_init(audio_handle, AUDIO_OUT_PACKET, 4, 4, Audio_MAL_Play, EVAL_AUDIO_PauseResume);
  res += um_handle_init(in_handle, AUDIO_IN_PACKET, 4, 4, adc_sampling_wrapper, adc_pause);

  return res;
}

/**
  * @brief  MuteCtl
  *         Mute or Unmute the audio current output
  * @param  cmd: can be 0 to unmute, or 1 to mute.
  * @retval AUDIO_OK if all operations succeed, AUDIO_FAIL else.
  */
static uint8_t  MuteCtl      (uint8_t cmd)
{
  /* Call low layer mute setting function */  
  if (EVAL_AUDIO_Mute(cmd) != 0)
  {
    return USBD_FAIL;
  }
  
  return USBD_OK;
}

/**
* @brief  usbd_audio_Init
*         Initializes the AUDIO interface.
* @param  pdev: device instance
* @param  cfgidx: Configuration index
* @retval status
*/
static uint8_t  usbd_audio_Init (void  *pdev, 
                                 uint8_t cfgidx)
{
  /* Open EP OUT */
  DCD_EP_Open(pdev,
              AUDIO_OUT_EP,
              AUDIO_OUT_PACKET,
              USB_OTG_EP_ISOC);

  /* Open EP IN */
  DCD_EP_Open(pdev,
              AUDIO_IN_EP,
              AUDIO_IN_PACKET,
              USB_OTG_EP_ISOC);
  
